In [6]:
import pandas as pd
import numpy as np

In [5]:
df1 = pd.DataFrame( { 'a': [ 'a0', 'a1', 'a2', 'a3' ],
                      'b': [ 'b0', 'b1', 'b2', 'b3' ],
                      'c': [ 'c0', 'c1', 'c2', 'c3' ] },
                      index = [ 0, 1, 2, 3] )
df1

    a   b   c
0  a0  b0  c0
1  a1  b1  c1
2  a2  b2  c2
3  a3  b3  c3

In [7]:
df2 = pd.DataFrame( { 'a': [ 'a2', 'a3', 'a4', 'a5' ],
                      'b': [ 'b2', 'b3', 'b4', 'b5' ],
                      'c': [ 'c2', 'c3', 'c4', 'c5' ],
                      'd': [ 'd2', 'd3', 'd4', 'd5' ] },
                      index = [ 2, 3, 4, 5 ] )
df2

    a   b   c   d
2  a2  b2  c2  d2
3  a3  b3  c3  d3
4  a4  b4  c4  d4
5  a5  b5  c5  d5

In [10]:
df = pd.concat( [df1, df2], axis = 1)

In [11]:
df

     a    b    c    a    b    c    d
0   a0   b0   c0  NaN  NaN  NaN  NaN
1   a1   b1   c1  NaN  NaN  NaN  NaN
2   a2   b2   c2   a2   b2   c2   d2
3   a3   b3   c3   a3   b3   c3   d3
4  NaN  NaN  NaN   a4   b4   c4   d4
5  NaN  NaN  NaN   a5   b5   c5   d5

In [16]:
df0 = pd.concat( [df1, df2], ignore_index = True, axis = 1 )

In [17]:
df0

     0    1    2    3    4    5    6
0   a0   b0   c0  NaN  NaN  NaN  NaN
1   a1   b1   c1  NaN  NaN  NaN  NaN
2   a2   b2   c2   a2   b2   c2   d2
3   a3   b3   c3   a3   b3   c3   d3
4  NaN  NaN  NaN   a4   b4   c4   d4
5  NaN  NaN  NaN   a5   b5   c5   d5

In [21]:
df = pd.concat([df1, df2], join = 'inner', axis = 1)

In [22]:
df

    a   b   c   a   b   c   d
2  a2  b2  c2  a2  b2  c2  d2
3  a3  b3  c3  a3  b3  c3  d3

In [23]:
s1 = pd.Series( [ 1, 2, 3, 4 ], name = 'e')

In [24]:
s1

0    1
1    2
2    3
3    4
Name: e, dtype: int64

In [25]:
s2 = pd.Series( [ 10, 20, 30, 40 ] )